###################################################################

# Created by write_sdc on Wed Feb 27 12:10:13 2019

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_driving_cell -lib_cell inv_4x -library muddlib [get_ports ph1]
set_driving_cell -lib_cell inv_4x -library muddlib [get_ports ph2]
set_driving_cell -lib_cell inv_4x -library muddlib [get_ports reset]
set_driving_cell -lib_cell inv_4x -library muddlib [get_ports {op[5]}]
set_driving_cell -lib_cell inv_4x -library muddlib [get_ports {op[4]}]
set_driving_cell -lib_cell inv_4x -library muddlib [get_ports {op[3]}]
set_driving_cell -lib_cell inv_4x -library muddlib [get_ports {op[2]}]
set_driving_cell -lib_cell inv_4x -library muddlib [get_ports {op[1]}]
set_driving_cell -lib_cell inv_4x -library muddlib [get_ports {op[0]}]
set_driving_cell -lib_cell inv_4x -library muddlib [get_ports zero]
set_load -pin_load 0.0349584 [get_ports memread]
set_load -pin_load 0.0349584 [get_ports memwrite]
set_load -pin_load 0.0349584 [get_ports alusrca]
set_load -pin_load 0.0349584 [get_ports memtoreg]
set_load -pin_load 0.0349584 [get_ports iord]
set_load -pin_load 0.0349584 [get_ports pcen]
set_load -pin_load 0.0349584 [get_ports regwrite]
set_load -pin_load 0.0349584 [get_ports regdst]
set_load -pin_load 0.0349584 [get_ports {pcsrc[1]}]
set_load -pin_load 0.0349584 [get_ports {pcsrc[0]}]
set_load -pin_load 0.0349584 [get_ports {alusrcb[1]}]
set_load -pin_load 0.0349584 [get_ports {alusrcb[0]}]
set_load -pin_load 0.0349584 [get_ports {aluop[1]}]
set_load -pin_load 0.0349584 [get_ports {aluop[0]}]
set_load -pin_load 0.0349584 [get_ports {irwrite[3]}]
set_load -pin_load 0.0349584 [get_ports {irwrite[2]}]
set_load -pin_load 0.0349584 [get_ports {irwrite[1]}]
set_load -pin_load 0.0349584 [get_ports {irwrite[0]}]
create_clock [get_ports ph1]  -period 10  -waveform {0 5}
set_input_delay -clock ph1  0.5  [get_ports ph1]
set_input_delay -clock ph1  0.5  [get_ports ph2]
set_input_delay -clock ph1  0.5  [get_ports reset]
set_input_delay -clock ph1  0.5  [get_ports {op[5]}]
set_input_delay -clock ph1  0.5  [get_ports {op[4]}]
set_input_delay -clock ph1  0.5  [get_ports {op[3]}]
set_input_delay -clock ph1  0.5  [get_ports {op[2]}]
set_input_delay -clock ph1  0.5  [get_ports {op[1]}]
set_input_delay -clock ph1  0.5  [get_ports {op[0]}]
set_input_delay -clock ph1  0.5  [get_ports zero]
set_output_delay -clock ph1  0.5  [get_ports memread]
set_output_delay -clock ph1  0.5  [get_ports memwrite]
set_output_delay -clock ph1  0.5  [get_ports alusrca]
set_output_delay -clock ph1  0.5  [get_ports memtoreg]
set_output_delay -clock ph1  0.5  [get_ports iord]
set_output_delay -clock ph1  0.5  [get_ports pcen]
set_output_delay -clock ph1  0.5  [get_ports regwrite]
set_output_delay -clock ph1  0.5  [get_ports regdst]
set_output_delay -clock ph1  0.5  [get_ports {pcsrc[1]}]
set_output_delay -clock ph1  0.5  [get_ports {pcsrc[0]}]
set_output_delay -clock ph1  0.5  [get_ports {alusrcb[1]}]
set_output_delay -clock ph1  0.5  [get_ports {alusrcb[0]}]
set_output_delay -clock ph1  0.5  [get_ports {aluop[1]}]
set_output_delay -clock ph1  0.5  [get_ports {aluop[0]}]
set_output_delay -clock ph1  0.5  [get_ports {irwrite[3]}]
set_output_delay -clock ph1  0.5  [get_ports {irwrite[2]}]
set_output_delay -clock ph1  0.5  [get_ports {irwrite[1]}]
set_output_delay -clock ph1  0.5  [get_ports {irwrite[0]}]
